In [253]:
import pandas as pd

##Extraction

In [254]:
travel_data = pd.read_csv('https://drive.google.com/uc?id=1muwnik-uFGTKBdHmcQN5z68rD7qmdG-b')

In [255]:
travel_data.shape

(418, 6)

In [256]:
travel_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    object
 3   Travel End Date        418 non-null    object
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      415 non-null    object
dtypes: float64(1), object(5)
memory usage: 19.7+ KB

In [257]:
travel_data.head(4)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference

In [258]:
travel_data.describe

<bound method NDFrame.describe of               Employee     Destination Travel Start Date Travel End Date  \
0         Aaron Salter  OCEAN CITY, MD        2017-05-31      2017-06-02
1    Abigail Ratnofsky   SAN DIEGO, CA        2016-01-24      2016-01-29
2       Adam Kisthardt     ORLANDO, FL        2018-10-04      2018-10-09
3        Adam P. Jones  OCEAN CITY, MD        2016-06-19      2016-06-21
4          Alan Butsch   SAN DIEGO, CA        2019-11-19      2019-11-22
..                 ...             ...               ...             ...
413     Warren Jensen!  OCEAN CITY, MD   2017-11-06           2017-11-09
414        Warp Jensen  OCEAN CITY, MD        2019-03-25      2019-03-26
415     Whitney Kujawa  OCEAN CITY, MD        2017-11-06      2017-11-09
416      William Kinna   CHARLOTTE, NC        2017-05-21      2017-05-26
417             Xin Qi  OCEAN CITY, MD        2019-08-13      2019-08-17

     Actual Total Expenses Purpose Of Travel
0                   644.10        Conference
1                  2962.70        Conference
2                  1891.19        Conference
3                   324.36        Conference
4                  2141.51        Conference
..                     ...               ...
413                 502.45        Conference
414                  78.00        Conference
415                 567.00        Conference
416                2163.67        Conference
417                2107.51        Conference

[418 rows x 6 columns]>

In [259]:
travel_data = travel_data.drop_duplicates()

In [260]:
travel_data.shape

(418, 6)

## Cleaning

In [261]:
travel_dataset = travel_data.copy()

In [262]:
type(travel_dataset['Travel Start Date'])

pandas.core.series.Series

In [263]:
# function to remove white space
def remove_white_space(text):
    if type(text) == str:
        return  text.strip()
    return text

In [264]:
# applying the remove white space fxn
travel_dataset['Travel Start Date'] = travel_dataset['Travel Start Date'].apply(remove_white_space)

travel_dataset['Travel End Date'] = travel_dataset['Travel End Date'].apply(remove_white_space)

In [265]:
# converting to datetime
travel_dataset['Travel Start Date'] = pd.to_datetime(travel_dataset['Travel Start Date'])
travel_dataset['Travel End Date'] = pd.to_datetime(travel_dataset['Travel End Date'])

In [266]:
travel_dataset[travel_dataset['Purpose Of Travel'].isna()]

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel
126,Gaila Compton,"OCEAN CITY, MD",2019-09-25,2019-09-27,690.00,NaN
274,Mark Sheelor,"LAS VEGAS, NV",2017-03-06,2017-03-08,1411.34,NaN
385,Tamara Maldonado,"OCEAN CITY, MD",2017-10-19,2017-10-20,73.50,NaN

In [267]:
travel_dataset['Purpose Of Travel']= travel_dataset['Purpose Of Travel'].fillna('Not Provided')

In [268]:
travel_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    datetime64[ns]
 3   Travel End Date        418 non-null    datetime64[ns]
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      418 non-null    object
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 19.7+ KB

In [269]:
# extracting state and city from destination
def extract_state(text):
    result = text.lower()
    result = text.split(',')[1]
    return result

def extract_city(text):
    result = text.lower()
    result = text.split(',')[0]
    return result

In [270]:
travel_dataset['state'] = travel_dataset['Destination'].apply(extract_state)
travel_dataset['city'] = travel_dataset['Destination'].apply(extract_city)

In [271]:
travel_dataset.head(4)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,city
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference,MD,OCEAN CITY
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference,CA,SAN DIEGO
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference,FL,ORLANDO
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference,MD,OCEAN CITY

In [272]:
# extracting first name and last name from employee column
def extract_fname(text):
    result = text.capitalize()
    result = text.split(' ')[0]
    return result

def extract_lname(text):
    result = text.capitalize()
    result = text.split(' ')[1]
    return result

In [273]:
travel_dataset['first_name'] = travel_dataset['Employee'].apply(extract_fname)
travel_dataset['last_name'] = travel_dataset['Employee'].apply(extract_lname)

In [274]:
travel_dataset.head()

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,city,first_name,last_name
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference,MD,OCEAN CITY,Aaron,Salter
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference,CA,SAN DIEGO,Abigail,Ratnofsky
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference,FL,ORLANDO,Adam,Kisthardt
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference,MD,OCEAN CITY,Adam,P.
4,Alan Butsch,"SAN DIEGO, CA",2019-11-19,2019-11-22,2141.51,Conference,CA,SAN DIEGO,Alan,Butsch

In [275]:
columns = ['Employee', 'first_name', 'last_name', 'state', 'city', 'Travel Start Date', 'Travel End Date', 'Actual Total Expenses', 'Purpose Of Travel']

final_result = travel_dataset[columns].copy()

In [276]:
final_result.to_csv('cleaned_travel_dataset.csv')